# SetMarkerByClass

## Description
Procedure SetMarkerByClass sets the referenced object to use the class attribute marker style.

```pascal
PROCEDURE SetMarkerByClass(h : HANDLE);
```

```python

def vs.SetMarkerByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Sets so that the class arrow style is used for the object referenced by h.

## See Also
VS Functions:
SetObjArrow

## Version
Availability: from VectorWorks8.0
## Category
* Object Attributes